D.Suresh Roshi , 19PA1A0218 , EEE-A , II-I , AITTA

In [1]:
import numpy as np
import pandas as pd

# **1) Create a dataframe manually.**

In [35]:
df0 = pd.DataFrame({"Roll.no":["EEE01","EEE02","EEE03"],"Name":["A.Dora","A.Vishnu","B.Jyothi"]})
df0

  Roll.no      Name
0   EEE01    A.Dora
1   EEE02  A.Vishnu
2   EEE03  B.Jyothi

# **2) Import data into a dataframe**

In [36]:
df = pd.read_csv("students_placement_data.csv")
df.tail()

     Roll No Gender  ... registered_for_ Placement_Training  placement status
112      113      M  ...                                 NO        Not placed
113      114      M  ...                                 NO        Not placed
114      115      M  ...                                 NO        Not placed
115      116      M  ...                                 NO        Not placed
116      117      M  ...                                 NO        Not placed

[5 rows x 9 columns]

In [37]:
df.isna().any()

Roll No                               False
Gender                                False
Section                               False
SSC Percentage                         True
inter_Diploma_percentage              False
B.Tech_percentage                     False
Backlogs                              False
registered_for_ Placement_Training     True
placement status                      False
dtype: bool

In [38]:
df.describe(include="all")

           Roll No Gender  ... registered_for_ Placement_Training  placement status
count   117.000000    117  ...                                116               117
unique         NaN      2  ...                                  2                 2
top            NaN      M  ...                                yes        Not placed
freq           NaN     68  ...                                 67                78
mean     59.000000    NaN  ...                                NaN               NaN
std      33.919021    NaN  ...                                NaN               NaN
min       1.000000    NaN  ...                                NaN               NaN
25%      30.000000    NaN  ...                                NaN               NaN
50%      59.000000    NaN  ...                                NaN               NaN
75%      88.000000    NaN  ...                                NaN               NaN
max     117.000000    NaN  ...                                NaN               NaN

[11 rows x 9 columns]

In [39]:
df.shape

(117, 9)

# **3) Adding, Deleting, Modifying the rows/columns in a dataframe.**

**3.1) Adding a column**

In [40]:
df1 = pd.read_csv("hostlers_day_scholars.csv")
df1.tail()

    hostler/days scholar
112                    h
113                    h
114                    h
115                    h
116                    d

In [41]:
df["Hostler/Day_Scholar"] = df1.values
df.tail()

     Roll No Gender  ... placement status  Hostler/Day_Scholar
112      113      M  ...       Not placed                    h
113      114      M  ...       Not placed                    h
114      115      M  ...       Not placed                    h
115      116      M  ...       Not placed                    h
116      117      M  ...       Not placed                    d

[5 rows x 10 columns]

**3.2) Deleting a column**

In [42]:
del df["registered_for_ Placement_Training"]
df.tail()

     Roll No Gender Section  ...  Backlogs  placement status  Hostler/Day_Scholar
112      113      M       B  ...        16        Not placed                    h
113      114      M       B  ...         0        Not placed                    h
114      115      M       B  ...         0        Not placed                    h
115      116      M       B  ...         0        Not placed                    h
116      117      M       B  ...         0        Not placed                    d

[5 rows x 9 columns]

**3.3) Adding a row**

In [43]:
df2 = pd.DataFrame({"Roll No":[118],"Gender":["F"],"Section":["C"],"SSC Percentage":[98.4],"inter_Diploma_percentage":[99],"B.Tech_percentage":[75],"Backlogs":[0],"Hostler/Day_Scholar":["h"],"placement status":["Not placed"]},index=[117])
df2

     Roll No Gender Section  ...  Backlogs  Hostler/Day_Scholar  placement status
117      118      F       C  ...         0                    h        Not placed

[1 rows x 9 columns]

In [44]:
df = df.append(df2)
df.head()

   Roll No Gender Section  ...  Backlogs  placement status  Hostler/Day_Scholar
0        1      M       A  ...        18        Not placed                    d
1        2      F       A  ...         0            Placed                    d
2        3      F       A  ...        13        Not placed                    d
3        4      M       A  ...        17        Not placed                    d
4        5      M       A  ...        17        Not placed                    h

[5 rows x 9 columns]

**3.4) Deleting a row**

In [45]:
df=df.drop(3)
df.head()

   Roll No Gender Section  ...  Backlogs  placement status  Hostler/Day_Scholar
0        1      M       A  ...        18        Not placed                    d
1        2      F       A  ...         0            Placed                    d
2        3      F       A  ...        13        Not placed                    d
4        5      M       A  ...        17        Not placed                    h
5        6      M       A  ...         6        Not placed                    h

[5 rows x 9 columns]

**3.5) Modifying elements**

In [46]:
df.loc[1,"Hostler/Day_Scholar"]= "h"
df.head()

   Roll No Gender Section  ...  Backlogs  placement status  Hostler/Day_Scholar
0        1      M       A  ...        18        Not placed                    d
1        2      F       A  ...         0            Placed                    h
2        3      F       A  ...        13        Not placed                    d
4        5      M       A  ...        17        Not placed                    h
5        6      M       A  ...         6        Not placed                    h

[5 rows x 9 columns]

# **4) Applying functions on a dataframe.**

In [47]:
def incre(x):
  if x<70:
    return(x+0.005)
  else:
    return(x)

In [48]:
df['B.Tech_percentage'].apply(incre)
df.tail()

     Roll No Gender Section  ...  Backlogs  placement status  Hostler/Day_Scholar
113      114      M       B  ...         0        Not placed                    h
114      115      M       B  ...         0        Not placed                    h
115      116      M       B  ...         0        Not placed                    h
116      117      M       B  ...         0        Not placed                    d
117      118      F       C  ...         0        Not placed                    h

[5 rows x 9 columns]

# **5) Iterations on dataframe**

In [49]:
for index,rows in df[df["B.Tech_percentage"]>=80].iterrows():
  print(rows["Roll No"],"-",rows["B.Tech_percentage"])

18 - 85.39
60 - 81.1
71 - 80.47
97 - 88.1
102 - 83.38

# **6) Accessing the elements from a dataframe**

In [50]:
stu_data.loc[[1,2],["SSC Percentage","inter_Diploma_percentage"]]

   SSC Percentage  inter_Diploma_percentage
1            89.0                      92.4
2            67.0                      68.0

# **7) Different ways to deal with NAs in dataframe**

In [51]:
df["SSC Percentage"] = df["SSC Percentage"].replace(to_replace=np.nan,value=np.mean(df["SSC Percentage"]))
df.head()

   Roll No Gender Section  ...  Backlogs  placement status  Hostler/Day_Scholar
0        1      M       A  ...        18        Not placed                    d
1        2      F       A  ...         0            Placed                    h
2        3      F       A  ...        13        Not placed                    d
4        5      M       A  ...        17        Not placed                    h
5        6      M       A  ...         6        Not placed                    h

[5 rows x 9 columns]

# **8) Groupby operations on dataframe**

In [52]:
df3 = df.groupby("Gender")
df3["B.Tech_percentage"].agg(np.mean)

Gender
F    71.275400
M    57.300597
Name: B.Tech_percentage, dtype: float64

# **9) Merging the dataframes**

In [53]:
df4 = pd.read_csv("urban_rural.csv")
df4.tail()

     Roll No Urban/Rural
112       59       Rural
113       60       Rural
114        3       Urban
115        4       Urban
116        5       Urban

In [54]:
df4.shape

(117, 2)

In [55]:
df = pd.merge(df,df4,on="Roll No")
df.tail()

     Roll No Gender Section  ...  placement status  Hostler/Day_Scholar  Urban/Rural
111      113      M       B  ...        Not placed                    h        Urban
112      114      M       B  ...        Not placed                    h        Urban
113      115      M       B  ...        Not placed                    h        Urban
114      116      M       B  ...        Not placed                    h        Urban
115      117      M       B  ...        Not placed                    d        Urban

[5 rows x 10 columns]